bigtreetech/BIGTREETECH-OCTOPUS-V1.0/Firmware/RepRapFirmware/RRFBuild-SourceCode/CoreN2G/src/atmel/SAMC21_DFP/1.2.176/samc21/atdf/ATSAMC21E16A.atdf
      <value-group name="CCL_LUTCTRL__FILTSEL">
        <value name="DISABLE" caption="Filter disabled" value="0"/>
        <value name="SYNCH" caption="Synchronizer enabled" value="1"/>
        <value name="FILTER" caption="Filter enabled" value="2"/>
      </value-group>
      <value-group name="CCL_LUTCTRL__INSEL0">
        <value name="MASK" caption="Masked input" value="0"/>
        <value name="FEEDBACK" caption="Feedback input source" value="1"/>
        <value name="LINK" caption="Linked LUT input source" value="2"/>
        <value name="EVENT" caption="Event in put source" value="3"/>
        <value name="IO" caption="I/O pin input source" value="4"/>
        <value name="AC" caption="AC input source" value="5"/>
        <value name="TC" caption="TC input source" value="6"/>
        <value name="ALTTC" caption="Alternate TC input source" value="7"/>
        <value name="TCC" caption="TCC input source" value="8"/>
        <value name="SERCOM" caption="SERCOM inout source" value="9"/>
      </value-group>
    </module>
    <module name="DAC" id="U2214" version="2.0.1" caption="Digital Analog Converter">
      <register-group name="DAC" caption="Digital Analog Converter">
        <register name="CTRLA" offset="0x0" rw="RW" access="WSYNC" size="1" initval="0x00" caption="Control A">
          <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
          <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
          <bitfield name="RUNSTDBY" caption="Run in Standby" mask="0x40"/>
        </register>
        <register name="CTRLB" offset="0x1" rw="RW" size="1" initval="0x00" caption="Control B">
          <bitfield name="EOEN" caption="External Output Enable" mask="0x1"/>
          <bitfield name="IOEN" caption="Internal Output Enable" mask="0x2"/>
          <bitfield name="LEFTADJ" caption="Left Adjusted Data" mask="0x4"/>
          <bitfield name="VPD" caption="Voltage Pump Disable" mask="0x8"/>
          <bitfield name="DITHER" caption="Dither Enable" mask="0x20"/>
          <bitfield name="REFSEL" caption="Reference Selection" mask="0xC0" values="DAC_CTRLB__REFSEL"/>
        </register>
        <register name="EVCTRL" offset="0x2" rw="RW" size="1" initval="0x00" caption="Event Control">
          <bitfield name="STARTEI" caption="Start Conversion Event Input" mask="0x1"/>
          <bitfield name="EMPTYEO" caption="Data Buffer Empty Event Output" mask="0x2"/>
          <bitfield name="INVEI" caption="Invert Event Input" mask="0x4"/>
        </register>
        <register name="INTENCLR" offset="0x4" rw="RW" size="1" atomic-op="clear:INTENCLR" initval="0x00" caption="Interrupt Enable Clear">
          <bitfield name="UNDERRUN" caption="Underrun Interrupt Enable" mask="0x1"/>
          <bitfield name="EMPTY" caption="Data Buffer Empty Interrupt Enable" mask="0x2"/>
        </register>
        <register name="INTENSET" offset="0x5" rw="RW" size="1" atomic-op="set:INTENSET" initval="0x00" caption="Interrupt Enable Set">
          <bitfield name="UNDERRUN" caption="Underrun Interrupt Enable" mask="0x1"/>
          <bitfield name="EMPTY" caption="Data Buffer Empty Interrupt Enable" mask="0x2"/>
        </register>
        <register name="INTFLAG" offset="0x6" rw="RW" size="1" atomic-op="clear:INTFLAG" initval="0x00" caption="Interrupt Flag Status and Clear">
          <bitfield name="UNDERRUN" caption="Underrun" mask="0x1"/>
          <bitfield name="EMPTY" caption="Data Buffer Empty" mask="0x2"/>
        </register>
        <register name="STATUS" offset="0x7" rw="R" size="1" initval="0x00" caption="Status">
          <bitfield name="READY" caption="Ready" mask="0x1"/>
        </register>
        <register name="DATA" offset="0x8" rw="W" access="WSYNC" size="2" initval="0x0000" caption="Data">
          <bitfield name="DATA" caption="Data value to be converted" mask="0xFFFF"/>
        </register>
        <register name="DATABUF" offset="0xC" rw="W" access="WSYNC" size="2" initval="0x0000" caption="Data Buffer">
          <bitfield name="DATABUF" caption="Data Buffer" mask="0xFFFF"/>
        </register>
        <register name="SYNCBUSY" offset="0x10" rw="R" size="4" initval="0x00000000" caption="Synchronization Busy">
          <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
          <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
          <bitfield name="DATA" caption="Data" mask="0x4"/>
          <bitfield name="DATABUF" caption="Data Buffer" mask="0x8"/>
        </register>
        <register name="DBGCTRL" offset="0x14" rw="RW" size="1" initval="0x00" caption="Debug Control">
          <bitfield name="DBGRUN" caption="Debug Run" mask="0x1"/>
        </register>
      </register-group>
      <value-group name="DAC_CTRLB__REFSEL">
        <value name="INT1V" caption="Internal 1.0V reference" value="0"/>
        <value name="AVCC" caption="AVCC" value="1"/>
        <value name="VREFP" caption="External reference" value="2"/>
      </value-group>
    </module>
    <module name="DIVAS" id="U2258" version="1.0.0" caption="Divide and Square Root Accelerator">
      <register-group name="DIVAS" caption="Divide and Square Root Accelerator">
        <register name="CTRLA" offset="0x0" rw="RW" size="1" initval="0x00" caption="Control">
          <bitfield name="SIGNED" caption="Signed" mask="0x1"/>
          <bitfield name="DLZ" caption="Disable Leading Zero Optimization" mask="0x2"/>
        </register>
        <register name="STATUS" offset="0x4" rw="RW" size="1" initval="0x00" caption="Status">
          <bitfield name="BUSY" caption="DIVAS Accelerator Busy" mask="0x1"/>
          <bitfield name="DBZ" caption="Writing a one to this bit clears DBZ to zero" mask="0x2"/>
        </register>
        <register name="DIVIDEND" offset="0x8" rw="RW" size="4" initval="0x00000000" caption="Dividend">
          <bitfield name="DIVIDEND" caption="DIVIDEND" mask="0xFFFFFFFF"/>
        </register>
        <register name="DIVISOR" offset="0xC" rw="RW" size="4" initval="0x00000000" caption="Divisor">
          <bitfield name="DIVISOR" caption="DIVISOR" mask="0xFFFFFFFF"/>
        </register>
        <register name="RESULT" offset="0x10" rw="R" size="4" initval="0x00000000" caption="Result">
          <bitfield name="RESULT" caption="RESULT" mask="0xFFFFFFFF"/>
        </register>
        <register name="REM" offset="0x14" rw="R" size="4" initval="0x00000000" caption="Remainder">
          <bitfield name="REM" caption="REM" mask="0xFFFFFFFF"/>
        </register>
        <register name="SQRNUM" offset="0x18" rw="RW" size="4" initval="0x00000000" caption="Square Root Input">
          <bitfield name="SQRNUM" caption="Square Root Input" mask="0xFFFFFFFF"/>
        </register>
      </register-group>
    </module>
